#include <iostream>
#include "menu.h"
using namespace std;
/**
    2. Описать класс «Множество из элементов- символов» (указатель на тип char;
    количество элементов в данном множестве  -  не более 256).
Определить и реализовать в классе конструкторы,  деструктор, перегрузить   операцию присваивания и  <<   >>.
Дополнить определение класса заданными перегруженными операциями
(*- пересечение, + -объединение, - -разность, < - включение, = = - эквивалентность )  .
Реализовать эти операции, а также операции  добавление и удаление элемента, Выполнить тестирование.
Написать программу, демонстрирующую работу с этим классом.
Программа должна содержать меню, позволяющее осуществить проверку всех методов класса.
Исходные данные 1-го и  2-го множества загружать из файлов. Результат операции записывать в итоговый файл.
Добавление и удаление элементов производить с клавиатуры.

*/
int main()
{
    Menu menu;
    menu.printHint();
    menu.startInput();
    return 0;
}
