#include <iostream>
#include <iomanip>
#include "week5.h"

using namespace std;
/**
    Заполнить квадратную матрицу (n x n) натуральными четными числами 2,4,6,8,...
    по сходящейся к центру линии ( по спирали).

    Input           Output
    ------------------------------------------------------------------------
    -1              Incorrect natural number. Re-enter:

    3                2  4  6
                    16 18  8
                    14 12 10

    5                2  4  6  8 10
                    32 34 36 38 12
                    30 48 50 40 14
                    28 46 44 42 16
                    26 24 22 20 18

    7                2   4   6   8  10  12  14
                    48  50  52  54  56  58  16
                    46  80  82  84  86  60  18
                    44  78  96  98  88  62  20
                    42  76  94  92  90  64  22
                    40  74  72  70  68  66  24
                    38  36  34  32  30  28  26

    10               2   4   6   8  10  12  14  16  18  20
                    72  74  76  78  80  82  84  86  88  22
                    70 128 130 132 134 136 138 140  90  24
                    68 126 168 170 172 174 176 142  92  26
                    66 124 166 192 194 196 178 144  94  28
                    64 122 164 190 200 198 180 146  96  30
                    62 120 162 188 186 184 182 148  98  32
                    60 118 160 158 156 154 152 150 100  34
                    58 116 114 112 110 108 106 104 102  36
                    56  54  52  50  48  46  44  42  40  38

*/

int main()
{
    int n;
    enterNatural(n);
    int **matrix = createMatrix(n);
    int value = enterMatrixWithTwoes(matrix, n);
    printMatrix(matrix,n, value);
    return 0;
}
